test_results/benchmarks/coroutine_perf_20260314_002251.txt
=== SET Operations ===
====== SET ======
  10000 requests completed in 14.08 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 2.783 milliseconds (cumulative count 1)
50.000% <= 14.087 milliseconds (cumulative count 5022)
75.000% <= 15.199 milliseconds (cumulative count 7524)
87.500% <= 15.959 milliseconds (cumulative count 8752)
93.750% <= 16.447 milliseconds (cumulative count 9400)
96.875% <= 16.847 milliseconds (cumulative count 9696)
98.438% <= 17.743 milliseconds (cumulative count 9853)
99.219% <= 21.455 milliseconds (cumulative count 9922)
99.609% <= 25.423 milliseconds (cumulative count 9961)
99.805% <= 31.407 milliseconds (cumulative count 9990)
99.902% <= 34.399 milliseconds (cumulative count 9991)
99.951% <= 38.047 milliseconds (cumulative count 9996)
99.976% <= 39.583 milliseconds (cumulative count 9998)
99.988% <= 40.287 milliseconds (cumulative count 9999)
99.994% <= 41.279 milliseconds (cumulative count 10000)
100.000% <= 41.279 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.010% <= 3.103 milliseconds (cumulative count 1)
0.030% <= 5.103 milliseconds (cumulative count 3)
0.100% <= 6.103 milliseconds (cumulative count 10)
0.310% <= 7.103 milliseconds (cumulative count 31)
0.540% <= 8.103 milliseconds (cumulative count 54)
1.130% <= 9.103 milliseconds (cumulative count 113)
2.630% <= 10.103 milliseconds (cumulative count 263)
6.590% <= 11.103 milliseconds (cumulative count 659)
14.440% <= 12.103 milliseconds (cumulative count 1444)
28.910% <= 13.103 milliseconds (cumulative count 2891)
50.530% <= 14.103 milliseconds (cumulative count 5053)
72.840% <= 15.103 milliseconds (cumulative count 7284)
89.560% <= 16.103 milliseconds (cumulative count 8956)
97.550% <= 17.103 milliseconds (cumulative count 9755)
98.830% <= 18.111 milliseconds (cumulative count 9883)
98.930% <= 20.111 milliseconds (cumulative count 9893)
99.120% <= 21.103 milliseconds (cumulative count 9912)
99.320% <= 22.111 milliseconds (cumulative count 9932)
99.420% <= 23.103 milliseconds (cumulative count 9942)
99.500% <= 24.111 milliseconds (cumulative count 9950)
99.580% <= 25.103 milliseconds (cumulative count 9958)
99.710% <= 26.111 milliseconds (cumulative count 9971)
99.800% <= 31.103 milliseconds (cumulative count 9980)
99.900% <= 32.111 milliseconds (cumulative count 9990)
99.910% <= 35.103 milliseconds (cumulative count 9991)
99.930% <= 36.127 milliseconds (cumulative count 9993)
99.940% <= 37.119 milliseconds (cumulative count 9994)
99.960% <= 38.111 milliseconds (cumulative count 9996)
99.970% <= 39.103 milliseconds (cumulative count 9997)
99.980% <= 40.127 milliseconds (cumulative count 9998)
99.990% <= 41.119 milliseconds (cumulative count 9999)
100.000% <= 42.111 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 710.18 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       14.031     2.776    14.087    16.607    20.719    41.279

=== GET Operations ===
====== GET ======
  10000 requests completed in 14.09 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 3.839 milliseconds (cumulative count 1)
50.000% <= 14.151 milliseconds (cumulative count 5045)
75.000% <= 15.191 milliseconds (cumulative count 7513)
87.500% <= 15.783 milliseconds (cumulative count 8754)
93.750% <= 16.343 milliseconds (cumulative count 9384)
96.875% <= 16.751 milliseconds (cumulative count 9691)
98.438% <= 17.167 milliseconds (cumulative count 9846)
99.219% <= 17.839 milliseconds (cumulative count 9929)
99.609% <= 22.239 milliseconds (cumulative count 9970)
99.805% <= 24.175 milliseconds (cumulative count 9990)
99.902% <= 30.623 milliseconds (cumulative count 9991)
99.951% <= 35.103 milliseconds (cumulative count 9996)
99.976% <= 36.799 milliseconds (cumulative count 9998)
99.988% <= 37.887 milliseconds (cumulative count 9999)
99.994% <= 38.943 milliseconds (cumulative count 10000)
100.000% <= 38.943 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.010% <= 4.103 milliseconds (cumulative count 1)
0.020% <= 5.103 milliseconds (cumulative count 2)
0.100% <= 6.103 milliseconds (cumulative count 10)
0.290% <= 7.103 milliseconds (cumulative count 29)
0.590% <= 8.103 milliseconds (cumulative count 59)
0.980% <= 9.103 milliseconds (cumulative count 98)
2.010% <= 10.103 milliseconds (cumulative count 201)
4.750% <= 11.103 milliseconds (cumulative count 475)
11.750% <= 12.103 milliseconds (cumulative count 1175)
25.950% <= 13.103 milliseconds (cumulative count 2595)
49.010% <= 14.103 milliseconds (cumulative count 4901)
72.970% <= 15.103 milliseconds (cumulative count 7297)
91.710% <= 16.103 milliseconds (cumulative count 9171)
98.210% <= 17.103 milliseconds (cumulative count 9821)
99.320% <= 18.111 milliseconds (cumulative count 9932)
99.600% <= 19.103 milliseconds (cumulative count 9960)
99.700% <= 23.103 milliseconds (cumulative count 9970)
99.900% <= 25.103 milliseconds (cumulative count 9990)
99.910% <= 31.103 milliseconds (cumulative count 9991)
99.920% <= 32.111 milliseconds (cumulative count 9992)
99.930% <= 33.119 milliseconds (cumulative count 9993)
99.940% <= 34.111 milliseconds (cumulative count 9994)
99.960% <= 35.103 milliseconds (cumulative count 9996)
99.970% <= 36.127 milliseconds (cumulative count 9997)
99.980% <= 37.119 milliseconds (cumulative count 9998)
99.990% <= 38.111 milliseconds (cumulative count 9999)
100.000% <= 39.103 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 709.52 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       14.044     3.832    14.151    16.447    17.535    38.943

=== Mixed Operations ===
====== SET ======
  10000 requests completed in 14.40 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 5.023 milliseconds (cumulative count 1)
50.000% <= 14.511 milliseconds (cumulative count 5001)
75.000% <= 15.471 milliseconds (cumulative count 7508)
87.500% <= 16.191 milliseconds (cumulative count 8754)
93.750% <= 16.831 milliseconds (cumulative count 9379)
96.875% <= 17.263 milliseconds (cumulative count 9694)
98.438% <= 17.823 milliseconds (cumulative count 9851)
99.219% <= 18.511 milliseconds (cumulative count 9926)
99.609% <= 23.839 milliseconds (cumulative count 9970)
99.805% <= 25.615 milliseconds (cumulative count 9990)
99.902% <= 35.327 milliseconds (cumulative count 9991)
99.951% <= 38.943 milliseconds (cumulative count 9996)
99.976% <= 40.735 milliseconds (cumulative count 9998)
99.988% <= 41.663 milliseconds (cumulative count 9999)
99.994% <= 42.495 milliseconds (cumulative count 10000)
100.000% <= 42.495 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.010% <= 5.103 milliseconds (cumulative count 1)
0.040% <= 6.103 milliseconds (cumulative count 4)
0.300% <= 7.103 milliseconds (cumulative count 30)
0.580% <= 8.103 milliseconds (cumulative count 58)
0.850% <= 9.103 milliseconds (cumulative count 85)
2.090% <= 10.103 milliseconds (cumulative count 209)
4.030% <= 11.103 milliseconds (cumulative count 403)
10.160% <= 12.103 milliseconds (cumulative count 1016)
22.310% <= 13.103 milliseconds (cumulative count 2231)
42.340% <= 14.103 milliseconds (cumulative count 4234)
66.540% <= 15.103 milliseconds (cumulative count 6654)
86.190% <= 16.103 milliseconds (cumulative count 8619)
96.820% <= 17.103 milliseconds (cumulative count 9682)
99.100% <= 18.111 milliseconds (cumulative count 9910)
99.400% <= 19.103 milliseconds (cumulative count 9940)
99.500% <= 20.111 milliseconds (cumulative count 9950)
99.600% <= 23.103 milliseconds (cumulative count 9960)
99.700% <= 24.111 milliseconds (cumulative count 9970)
99.800% <= 25.103 milliseconds (cumulative count 9980)
99.900% <= 26.111 milliseconds (cumulative count 9990)
99.920% <= 36.127 milliseconds (cumulative count 9992)
99.930% <= 37.119 milliseconds (cumulative count 9993)
99.940% <= 38.111 milliseconds (cumulative count 9994)
99.960% <= 39.103 milliseconds (cumulative count 9996)
99.970% <= 40.127 milliseconds (cumulative count 9997)
99.980% <= 41.119 milliseconds (cumulative count 9998)
99.990% <= 42.111 milliseconds (cumulative count 9999)
100.000% <= 43.103 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 694.25 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       14.355     5.016    14.511    16.895    18.015    42.495
====== GET ======
  10000 requests completed in 14.51 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 4.647 milliseconds (cumulative count 1)
50.000% <= 14.559 milliseconds (cumulative count 5004)
75.000% <= 15.511 milliseconds (cumulative count 7504)
87.500% <= 16.095 milliseconds (cumulative count 8767)
93.750% <= 16.623 milliseconds (cumulative count 9375)
96.875% <= 17.071 milliseconds (cumulative count 9699)
98.438% <= 17.647 milliseconds (cumulative count 9852)
99.219% <= 18.319 milliseconds (cumulative count 9925)
99.609% <= 22.351 milliseconds (cumulative count 9968)
99.805% <= 23.007 milliseconds (cumulative count 9990)
99.902% <= 34.303 milliseconds (cumulative count 9991)
99.951% <= 38.399 milliseconds (cumulative count 9996)
99.976% <= 39.423 milliseconds (cumulative count 9998)
99.988% <= 39.935 milliseconds (cumulative count 9999)
99.994% <= 40.351 milliseconds (cumulative count 10000)
100.000% <= 40.351 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.030% <= 5.103 milliseconds (cumulative count 3)
0.070% <= 6.103 milliseconds (cumulative count 7)
0.160% <= 7.103 milliseconds (cumulative count 16)
0.370% <= 8.103 milliseconds (cumulative count 37)
0.820% <= 9.103 milliseconds (cumulative count 82)
1.310% <= 10.103 milliseconds (cumulative count 131)
3.110% <= 11.103 milliseconds (cumulative count 311)
7.790% <= 12.103 milliseconds (cumulative count 779)
20.190% <= 13.103 milliseconds (cumulative count 2019)
37.260% <= 14.103 milliseconds (cumulative count 3726)
63.190% <= 15.103 milliseconds (cumulative count 6319)
87.700% <= 16.103 milliseconds (cumulative count 8770)
97.130% <= 17.103 milliseconds (cumulative count 9713)
99.110% <= 18.111 milliseconds (cumulative count 9911)
99.400% <= 19.103 milliseconds (cumulative count 9940)
99.500% <= 21.103 milliseconds (cumulative count 9950)
99.900% <= 23.103 milliseconds (cumulative count 9990)
99.910% <= 35.103 milliseconds (cumulative count 9991)
99.920% <= 36.127 milliseconds (cumulative count 9992)
99.930% <= 37.119 milliseconds (cumulative count 9993)
99.950% <= 38.111 milliseconds (cumulative count 9995)
99.970% <= 39.103 milliseconds (cumulative count 9997)
99.990% <= 40.127 milliseconds (cumulative count 9999)
100.000% <= 41.119 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 689.37 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       14.454     4.640    14.559    16.847    18.047    40.351